판다스 - 데이터 분석 도구       
    - 구성요소 3가지        
        - Series : 1개의 컬럼 값만으로 1차원 데이터셋       
        - DataFram : Colum X Row 2차원 데이터셋(테이블구조)         
        - Index : 고유한 키값값

#### Series 구조
- 판다스가 제공하는 객체
- 객체생성 : 생성자 호출 -> 전역변수 초기화 - 파라미터에 아무것도 없는 것 : 디폴트생성자
- pd는 Series의 소유주다.
- Series라는 객체를 생성 할때 파라미터 값에 리스트 타입이 올수 있다.

In [11]:
import pandas as pd # pa
se = pd.Series([1, 2, 3, 4, 5])
# se = pd.Series({"meanid" : "kiwi"})

특정 값을 추출 - values, index

In [12]:
print(se[0])
print(se[3])

1
4

In [13]:
# 파라미터에 리스트도 딕셔너리도 튜플도 됩니다.
se = pd.Series([1, 2, 3])

In [14]:
se[len(se)-1]

np.int64(3)

In [15]:
se[2]

np.int64(3)

In [16]:
se[len(se)-1]==[2]

array([False])

In [17]:
se.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
se.values # Series 안에 Numpy가 포함되어 있다.

array([1, 2, 3])

In [9]:
## index 변경
se.index = ["a", "b", "c", "d", "e"]
se

ValueError: Length mismatch: Expected axis has 3 elements, new values have 5 elements

In [19]:
print(se['a'])
print(se['d'])

KeyError: 'a'

index 이름을 명시하여 Series 생성하기

In [20]:
# Series 생성2 - index명시
# Series(파라미터1, 파라미터2, 파라미터3...)
se2 = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
se2.name = "numOrder" # value 이름
se2.index.name = "numName" # index 이름
se2

numName
a    1
b    2
c    3
d    4
e    5
Name: numOrder, dtype: int64

In [21]:
se.index

RangeIndex(start=0, stop=3, step=1)

In [22]:
se > 2

0    False
1    False
2     True
dtype: bool

In [23]:
se[se > 2]

2    3
dtype: int64

In [24]:
se[se < 3]

0    1
1    2
dtype: int64

In [25]:
se[-(se > 2)]

0    1
1    2
dtype: int64

DataFrame (데이터 프레임)       
- Pandas에서 행과 열을 가지는 자료구조
- 데이터 프레임은 2차원이므로 행 방향 인덱스와 열 방향 인덱스가 존제
- 데이터 프레임은 열, 인덱스, 값으로 구성됨

In [26]:
data = {
    'name':['Lee', 'Park', 'Kim', 'Choi'],
    'score' : [85, 90, 100, 70],
    'grade' : ['B', 'A', 'A', 'C']
}
df = pd.DataFrame(data)
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [27]:
df = pd.DataFrame(data, columns=['name', 'grade', 'score'])
df

   name grade  score
0   Lee     B     85
1  Park     A     90
2   Kim     A    100
3  Choi     C     70

In [28]:
df.values

array([['Lee', 'B', 85],
       ['Park', 'A', 90],
       ['Kim', 'A', 100],
       ['Choi', 'C', 70]], dtype=object)

In [29]:
df.columns

Index(['name', 'grade', 'score'], dtype='object')

In [30]:
df.index.name = "NO"
df.columns.name = "Info"
df

Info  name grade  score
NO
0      Lee     B     85
1     Park     A     90
2      Kim     A    100
3     Choi     C     70

In [31]:
# 특정값 추출하기
df['name'].values

array(['Lee', 'Park', 'Kim', 'Choi'], dtype=object)

In [32]:
# 로우와 컬럼 값을 지정해 특정 값 추출이 가능하다.
df.loc[1,'name']

'Park'

In [33]:
df = df.set_index('name')
df.loc["Choi",'grade']

'C'

In [34]:
# DataFram을 딕셔너리로 변환
df.to_dict()

{'grade': {'Lee': 'B', 'Park': 'A', 'Kim': 'A', 'Choi': 'C'},
 'score': {'Lee': 85, 'Park': 90, 'Kim': 100, 'Choi': 70}}

In [35]:
import numpy as np
array = np.array([['Lee', 100, 'A'], ['Park', 95, 'A'], ['Kim', 85, 'B']])
df = pd.DataFrame(data, columns = ['name', 'score', 'grade'])
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [36]:
df.values

array([['Lee', 85, 'B'],
       ['Park', 90, 'A'],
       ['Kim', 100, 'A'],
       ['Choi', 70, 'C']], dtype=object)

데이터 셀렉션 및 필터링
1) [] - 컬럼기반의 필터링 또는 블린 인덱싱 필터링 제공 (예 : df.컬러명, df['컬럼명'], df[1:3], df[:2])
2) loc[인텍스명, 컬럼명] - 명칭(label) 기반 인덱싱 
    - index명, colum명 기준으로 데이터가 초기화됩니다.
    (예 : 하나의 행만 검색 - df.loc[0])

In [37]:
df.name

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [38]:
df['name']

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [42]:
# 콜론 앞에 숫자는 시작되는 index이고 콜론 뒤에 숫자는 미포함
df[1:3]

   name  score grade
1  Park     90     A
2   Kim    100     A

In [41]:
df[:3]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

In [40]:
df[:-1]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

2) loc[인텍스명, 컬럼명] - 명칭(label) 기반 인덱싱 
    - index명, colum명 기준으로 데이터가 초기화됩니다.<br>
    (예 : 하나의 행만 검색 - df.loc[0])

In [39]:
df.loc[0]

name     Lee
score     85
grade      B
Name: 0, dtype: object

In [43]:
# 여러 행을 검색할 때.
df.loc[[0, 1]]

   name  score grade
0   Lee     85     B
1  Park     90     A

In [45]:
# 여러 행과 열을 검색할 때.
df.loc[0:2, ("score", 'grade')]

   score grade
0     85     B
1     90     A
2    100     A

In [46]:
df[['name','grade']]

   name grade
0   Lee     B
1  Park     A
2   Kim     A
3  Choi     C

In [47]:
df.loc[[0, 2]]

  name  score grade
0  Lee     85     B
2  Kim    100     A

In [49]:
df.loc[0:2]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

iloc[인덱스, 컬럼인덱스] - 위치기반 인덱싱
- 0을 출발점으로하는 가로축, 세로축 좌표 기반의 행과 열 위치를 기반으로 데이터를 지정
- 행, 열 위치 값으로 정수를 사용할 수 있음, 오직 인덱스 기준으로 데이터를 가져옴

In [51]:
df.iloc[1, 0]

'Park'

In [52]:
df.iloc[0:2]

   name  score grade
0   Lee     85     B
1  Park     90     A

In [53]:
df.iloc[0:3, 0:2]

   name  score
0   Lee     85
1  Park     90
2   Kim    100

In [54]:
df.iloc[0:2, 0:1]

   name
0   Lee
1  Park

4. 불린(boolean) 인덱스

In [ ]:
df.loc[df[""]]

In [56]:
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [55]:
df.loc[df['grade'] == 'A']

   name  score grade
1  Park     90     A
2   Kim    100     A